Flow_Over_Heated_Plate_SS/Fluid-openfoam-turbulent_uncoupled/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 103500;

boundaryField
{

    inlet
    {
        type            calculated;
        value           $internalField;
    }

    outlet

    {
        type            calculated;
        value           $internalField;
    }

    outerWall
    {
        type            calculated;
        value           $internalField;
    }

    top
    {
        type            calculated;
        value           $internalField;
    }

    bottom
    {
        type            calculated;
        value           $internalField;
    }

    slip-bottom
    {
        type            calculated;
        value           $internalField;
    }

    interface
    {
        type            calculated;
        value           $internalField;
    }

    defaultFaces
    {
        type empty;
    }

}
