Flow_Over_Heated_Plate_SS/Fluid-openfoam-turbulent_uncoupled/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     buoyantSimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1;

writeControl    timeStep;

writeInterval   10;

writeFormat     ascii;

writePrecision  7;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable false;

// functions
// {
//     preCICE_Adapter
//     {
//         type preciceAdapterFunctionObject;
//         libs ("libpreciceAdapterFunctionObject.so");
//     }
// }
